Repository: spcolonna/toko
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# appSlogan
source: Be a warrior, create your path
es: Sé un guerrero, crea tu camino
pt: Seja um guerreiro, crie seu caminho

# loginButton
source: Log In
es: Iniciar Sesión
pt: Entrar

# createAccountButton
source: Create Account
es: Crear Cuenta
pt: Criar Conta

# forgotPasswordLink
source: Forgot your password?
es: ¿Olvidaste tu contraseña?
pt: Esqueceu sua senha?

# loginErrorTitle
source: Login Error
es: Error de Login
pt: Erro de Login

# loginErrorUserNotFound
source: No user found for that email.
es: No se encontró un usuario con ese correo electrónico.
pt: Nenhum usuário encontrado para este e-mail.

# loginErrorWrongPassword
source: Wrong password provided for that user.
es: La contraseña es incorrecta.
pt: Senha incorreta fornecida para este usuário.

# loginErrorInvalidCredential
source: The credentials provided are incorrect.
es: Las credenciales son incorrectas.
pt: As credenciais fornecidas estão incorretas.

# unexpectedError
source: An unexpected error occurred.
es: Ocurrió un error inesperado.
pt: Ocorreu um erro inesperado.

# registrationErrorTitle
source: Registration Error
es: Error de Registro
pt: Erro de Registro

# registrationErrorContent
source: Could not complete registration. The email may already be in use or the password is too weak.
es: No se pudo completar el registro. El correo puede ya estar en uso o la contraseña es muy débil.
pt: Não foi possível concluir o registro. O e-mail já pode estar em uso ou a senha é muito fraca.

# errorTitle
source: Error
pt: Erro

# genericErrorContent
source: An error occurred: {errorDetails}
es: Ocurrió un error: {errorDetails}
pt: Ocorreu um erro: {errorDetails}

# welcomeTitle
source: Welcome, {userName}!
es: ¡Bienvenido, {userName}!
pt: Bem-vindo, {userName}!

source: Teacher
es: Maestro
pt: Mestre

# sessionError
source: Error: Invalid session.
es: Error: Sesión no válida.
pt: Erro: Sessão inválida.

# noSchedulerClass
source: There are no classes scheduled for today.
es: No hay clases programadas para hoy.
pt: Não há aulas agendadas para hoje.

# choseClass
source: Select Class
es: Seleccionar Clase
pt: Selecionar Turma

# todayClass
source: Today's Classes
es: Clases de Hoy
pt: Aulas de Hoje

# takeAssistance
source: Take Attendance
es: Tomar Asistencia
pt: Marcar Presença

source: Loading...
es: Cargando...
pt: Carregando...

source: Active Students
es: Alumnos Activos
pt: Alunos Ativos

# pendingApplication
source: Pending Applications
es: Solicitudes Pendientes
pt: Solicitações Pendentes

source: Password
es: Contraseña
pt: Senha

source: Home
es: Inicio
pt: Início

source: Student
es: Alumno
pt: Aluno

# managment
source: Management
es: Gestión
pt: Gestão

source: Profile
es: Perfil
pt: Perfil

# actives
source: Active
es: Activos
pt: Ativos

source: Pending
es: Pendientes
pt: Pendentes

# inactives
source: Inactive
es: Inactivos
pt: Inativos

source: General
pt: Geral

# assistance
source: Attendance
es: Asistencia
pt: Presença

source: Payments
es: Pagos
pt: Pagamentos

source: Payment
es: Pago
pt: Pagamento

source: Progress
es: Progreso
pt: Progresso

# facturation
source: Billing
es: Facturación
pt: Faturamento

source: Change Assigned Plan
es: Cambiar Plan Asignado
pt: Alterar Plano Designado

source: Personal Data
es: Datos Personales
pt: Dados Pessoais

# birdthDate
source: Date of Birth
es: Fecha de Nacimiento
pt: Data de Nascimento

source: Gender
es: Género
pt: Gênero

source: years
es: años
pt: anos

source: Phone
es: Teléfono
pt: Telefone

# emergencyInfo
source: Emergency Information
es: Información de Emergencia
pt: Informações de Emergência

source: Contact
es: Contacto
pt: Contato

# medService
source: Medical Service
es: Servicio Médico
pt: Serviço Médico

# medInfo
source: Medical Information
es: Información Médica
pt: Informações Médicas

# noSpecify
source: Not specified
es: No especificado
pt: Não especificado

# changeRol
source: Change Role
es: Cambiar Rol
pt: Mudar Papel

# noPayment
source: There are no payments registered for this student.
es: No hay pagos registrados para este alumno.
pt: Não há pagamentos registrados para este aluno.

# noRegisterAssitance
source: There are no attendance records for this student.
es: No hay registros de asistencia para este alumno.
pt: Não há registros de presença para este aluno.

# classRoom
source: Class
es: Clase
pt: Aula

source: Confirm
es: Confirmar
pt: Confirmar

source: Cancel
es: Cancelar
pt: Cancelar

# eliminate
source: Delete
es: Eliminar
pt: Excluir

# deleteError
source: Error deleting: {e}
es: Error al eliminar: {e}
pt: Erro ao excluir: {e}

# rolUpdatedTo
source: Role updated to {rol}
es: Rol actualizado a {rol}
pt: Papel atualizado para {rol}

# deleteLevel
source: Deleted Level
es: Nivel Borrado
pt: Nível Excluído

# promotionTo
source: Promoted to {level}
es: Promovido a {level}
pt: Promovido para {level}

# notesValue
source: Notes: {notes}
es: Notas: {notes}
pt: Notas: {notes}

# notesLabel
source: Notes
es: Notas
pt: Notas

# maleGender
source: Male
es: Masculino
pt: Masculino

# femaleGender
source: Female
es: Femenino
pt: Feminino

# otherGender
source: Other
es: Otro
pt: Outro

# noSpecifyGender
source: Prefers not to say
es: Prefiere no decirlo
pt: Prefere não dizer

# noClassForTHisDay
source: There were no classes scheduled for the selected day.
es: No había clases programadas para el día seleccionado.
pt: Não havia aulas agendadas para o dia selecionado.

# classFor
source: Classes for {day}
es: Clases del {day}
pt: Aulas de {day}

# successAssistance
source: Attendance registered successfully.
es: Asistencia registrada con éxito.
pt: Presença registrada com sucesso.

# saveError
source: Error saving: {e}
es: Error al guardar: {e}
pt: Erro ao salvar: {e}

# successRevertPromotion
source: Promotion reverted successfully.
es: Promoción revertida con éxito.
pt: Promoção revertida com sucesso.

# errorToRevert
source: Error reverting: {e}
es: Error al revertir: {e}
pt: Erro ao reverter: {e}

source: Register Payment
es: Registrar Pago
pt: Registrar Pagamento

# selectPlan
source: Select a plan
es: Selecciona un plan
pt: Selecione um plano

source: Concept
es: Concepto
pt: Conceito

source: Amount
es: Monto
pt: Valor

source: Save Payment
es: Guardar Pago
pt: Salvar Pagamento

# promotionOrChangeLevel
source: Promote or Correct Level
es: Promover o Corregir Nivel
pt: Promover ou Corrigir Nível

# choseNewLevel
source: Select the new level
es: Selecciona el nuevo nivel
pt: Selecione o novo nível

source: optional
es: opcional
pt: opcional

# studentSuccessPromotion
source: Student promoted successfully!
es: ¡Alumno promovido con éxito!
pt: Aluno promovido com sucesso!

# promotionError
source: Error promoting: {e}
es: Error al promover: {e}
pt: Erro ao promover: {e}

# changeRolMember
source: Change Member Role
es: Cambiar Rol del Miembro
pt: Mudar Papel do Membro

source: instructor
pt: instrutor

source: Save
es: Guardar
pt: Salvar

# updateRolSuccess
source: Role updated successfully.
es: Rol actualizado con éxito.
pt: Papel atualizado com sucesso.

# updateRolError
source: Error changing role: {e}
es: Error al cambiar el rol: {e}
pt: Erro ao mudar o papel: {e}

# successPayment
source: Payment registered successfully.
es: Pago registrado con éxito.
pt: Pagamento registrado com sucesso.

# paymentError
source: Error registering payment: {e}
es: Error al registrar el pago: {e}
pt: Erro ao registrar o pagamento: {e}

# assignPlan
source: Assign Payment Plan
es: Asignar Plan de Pago
pt: Designar Plano de Pagamento

source: Remove assigned plan
es: Quitar plan asignado
pt: Remover plano designado

# withPutLevel
source: No Level
es: Sin Nivel
pt: Sem Nível

# registerPausedAssistance
source: Register Past Attendance
es: Registrar Asistencia Pasada
pt: Registrar Presença Passada

# levelPromotion
source: Promote Level
es: Promover Nivel
pt: Promover Nível

# assignTechnic
source: Assign Techniques
es: Asignar Técnicas
pt: Designar Técnicas

# notassignedPaymentPlan
source: No payment plan assigned.
es: Sin plan de pago asignado.
pt: Nenhum plano de pagamento designado.

# paymentPlanNotFoud
source: Assigned plan (ID: {assignedPlanId}) not found.
es: Plan asignado (ID: {assignedPlanId}) no encontrado.
pt: Plano designado (ID: {assignedPlanId}) não encontrado.

source: Contact Data
es: Datos de Contacto
pt: Dados de Contato

source: Save and Continue
es: Guardar y Continuar
pt: Salvar e Continuar

source: Subscription Expired
es: Suscripción Vencida
pt: Assinatura Expirada

# subscriptionExpiredMessage
source: Your access to teacher tools has been paused. To renew your subscription and reactivate your account, please contact the administrator.
es: Tu acceso a las herramientas de maestro ha sido pausado. Para renovar tu suscripción y reactivar tu cuenta, por favor, contacta al administrador.
pt: Seu acesso às ferramentas de professor foi pausado. Para renovar sua assinatura e reativar sua conta, por favor, entre em contato com o administrador.

# contactAdmin
source: Contact Administrator
es: Contactar al Administrador
pt: Contatar Administrador

# renewalSubject
source: Subscription Renewal - Warrior Path
es: Renovación de Suscripción - Warrior Path
pt: Renovação de Assinatura - Warrior Path

# mailError
source: Could not open mail application.
es: No se pudo abrir la aplicación de correo.
pt: Não foi possível abrir o aplicativo de e-mail.

# mailLaunchError
source: Error trying to open mail: {e}
es: Error al intentar abrir el correo: {e}
pt: Erro ao tentar abrir o e-mail: {e}

# nameAndMartialArtRequired
source: Name and Martial Art are required.
es: Nombre y Arte Marcial son requeridos.
pt: Nome e Arte Marcial são obrigatórios.

# needSelectSubSchool
source: If it is a sub-school, you must select the main school.
es: Si es una sub-escuela, debes seleccionar la escuela principal.
pt: Se for uma sub-escola, você deve selecionar a escola principal.

# notAuthenticatedUser
source: User not authenticated.
es: Usuario no autenticado.
pt: Usuário não autenticado.

# createSchoolError
source: Error creating school: {e}
es: Error al crear la escuela: {e}
pt: Erro ao criar a escola: {e}

# crateSchoolStep2
source: Create Your School (Step 2)
es: Crear tu Escuela (Paso 2)
pt: Crie Sua Escola (Passo 2)

# isSubSchool
source: Is it a Sub-School?
es: ¿Es una Sub-Escuela?
pt: É uma sub-escola?

source: Pick a color
es: Elige un color
pt: Escolha uma cor

source: Select
es: Seleccionar
pt: Selecionar

# addYourFirstLevel
source: Add your first level below.
es: Añade tu primer nivel abajo.
pt: Adicione seu primeiro nível abaixo.

source: Add Level
es: Añadir Nivel
pt: Adicionar Nível

source: School Management
es: Gestión de la Escuela
pt: Gestão da Escola

# noActiveSchoolError
source: Error: No active school in session.
es: Error: No hay una escuela activa en la sesión.
pt: Erro: Nenhuma escola ativa na sessão.

# myProfileAndActions
source: My Profile & Actions
es: Mi Perfil y Acciones
pt: Meu Perfil e Ações

source: Log Out
es: Cerrar Sesión
pt: Sair

source: Edit My Profile
es: Editar mi Perfil
pt: Editar Meu Perfil

# updateProfileInfo
source: Update your name, photo, or password.
es: Actualiza tu nombre, foto o contraseña.
pt: Atualize seu nome, foto ou senha.

source: Switch Profile/School
es: Cambiar de Perfil/Escuela
pt: Mudar de Perfil/Escola

# accessOtherRoles
source: Access your other roles or schools.
es: Accede a tus otros roles o escuelas.
pt: Acesse seus outros papéis ou escolas.

source: Enroll in another School
es: Inscribirme en otra Escuela
pt: Inscrever-se em outra Escola

# joinAnotherCommunity
source: Join another community as a student.
es: Únete a otra comunidad como alumno.
pt: Junte-se a outra comunidade como aluno.

# createNewSchool
source: Create a New School
es: Crear una Nueva Escuela
pt: Criar uma Nova Escola

# expandYourLegacy
source: Expand your legacy or open a new branch.
es: Expande tu legado o abre una nueva sucursal.
pt: Expanda seu legado ou abra uma nova filial.

source: Students
es: Alumnos
pt: Alunos

source: Reject
es: Rechazar
pt: Rejeitar

source: Accept
es: Aceptar
pt: Aceitar

source: Select Profile
es: Seleccionar Perfil
pt: Selecionar Perfil

source: Add Schedule
es: Añadir Horario
pt: Adicionar Horário

source: Save Schedule
es: Guardar Horario
pt: Salvar Horário

source: Confirm Deletion
es: Confirmar Eliminación
pt: Confirmar Exclusão

# confirmDeleteSchedule
source: Are you sure you want to delete this schedule?
es: ¿Estás seguro de que quieres eliminar este horario?
pt: Tem certeza que deseja excluir este horário?

source: Manage Schedules
es: Gestionar Horarios
pt: Gerenciar Horários

# eventNoLongerExists
source: This event no longer exists.
es: Este evento ya no existe.
pt: Este evento não existe mais.

source: Attendees
es: Asistentes
pt: Participantes

source: Manage Guests
es: Gestionar Invitados
pt: Gerenciar Convidados

source: End Time
es: Hora de Fin
pt: Hora de Fim

source: Start Time
es: Hora de Inicio
pt: Hora de Início

source: Days of the week
es: Días de la semana
pt: Dias da semana

source: Class Title
es: Título de la Clase
pt: Título da Turma

# classTitleExample
source: Ex: Kids, Adults, Kicks
es: Ej: Niños, Adultos, Kicks
pt: Ex: Crianças, Adultos, Chutes

# scheduleSavedSuccess
source: Schedule saved successfully.
es: Horario guardado con éxito.
pt: Horário salvo com sucesso.

# endTimeAfterStartTimeError
source: The end time must be after the start time.
es: La hora de fin debe ser posterior a la hora de inicio.
pt: A hora de fim deve ser posterior à hora de início.

# pleaseFillAllFields
source: Please fill all required fields.
es: Por favor, completa todos los campos requeridos.
pt: Por favor, preencha todos os campos obrigatórios.

source: Unknown School
es: Escuela Desconocida
pt: Escola Desconhecida

source: No active profiles found.
es: No se encontraron perfiles activos.
pt: Não há perfis ativos.

# enterAs
source: Enter as {e}
es: Entrar como {e}
pt: Entrar como {e}

# inSchool
source: in {message}
es: en {message}
pt: em {message}

# yourAnswer
source: Your Answer: {message}
es: Tu Respuesta: {message}
pt: Sua Resposta: {message}

source: Cost
es: Costo
pt: Custo

source: Time
es: Hora
pt: Hora

source: Date
es: Fecha
pt: Data

source: Location
es: Ubicación
pt: Localização

source: Invited
es: Invitado
pt: Convidado

source: Event Details
es: Detalles del Evento
pt: Detalhes do Evento

# errorSendingResponse
source: Error sending response: {e}
es: Error al enviar respuesta: {e}
pt: Erro ao enviar resposta: {e}

# responseSent
source: Response sent: {message}
es: Respuesta enviada: {message}
pt: Resposta enviada: {message}

source: Manage Events
es: Gestionar Eventos
pt: Gerenciar Eventos

# manageEventsDescription
source: Create exams, tournaments, and seminars.
es: Crea exámenes, torneos y seminarios.
pt: Crie exames, torneios e seminários.

# manageSchedulesDescription
source: Define the shifts and days of your classes.
es: Define los turnos y días de tus clases.
pt: Defina os turnos e dias de suas aulas.

source: Manage Levels
es: Gestionar Niveles
pt: Gerenciar Níveis

source: Manage Techniques
es: Gestionar Técnicas
pt: Gerenciar Técnicas

source: Manage Finances
es: Gestionar Finanzas
pt: Gerenciar Finanças

# manageFinancesDescription
source: Adjust prices and payment plans.
es: Ajusta los precios y planes de pago.
pt: Ajuste os preços e planos de pagamento.

source: Edit School Data
es: Editar Datos de la Escuela
pt: Editar Dados da Escola

# editSchoolDataDescription
source: Modify the address, phone, description, etc.
es: Modifica la dirección, teléfono, descripción, etc.
pt: Modifique o endereço, telefone, descrição, etc.

source: Error: No active session.
es: Error: No hay una sesión activa.
pt: Erro: Nenhuma sessão ativa.

# profileLoadedError
source: Could not load profile.
es: No se pudo cargar el perfil.
pt: Não foi possível carregar o perfil.

source: Full Name
es: Nombre y Apellido
pt: Nome e Sobrenome

source: Save Changes
es: Guardar Cambios
pt: Salvar Alterações

# emergencyInfoNotice
source: This information will only be visible to your school's teachers if necessary.
es: Esta información solo será visible para los maestros de tu escuela en caso de ser necesario.
pt: Esta informação será visível apenas para os professores da sua escola, se necessário.

source: Emergency Contact Name
es: Nombre del Contacto de Emergencia
pt: Nome do Contato de Emergência

source: Emergency Contact Phone
es: Teléfono del Contacto de Emergencia
pt: Telefone do Contato de Emergência

source: Medical Emergency Service
es: Servicio de Emergencia Médica
pt: Serviço de Emergência Médica

# medicalServiceExample
source: Ex: 911, Local Paramedics
es: Ej: SEMM, Emergencia Uno, UCM
pt: Ex: SAMU, etc.

# relevantMedicalInfo
source: Relevant Medical Information
es: Información Médica Relevante
pt: Informações Médicas Relevantes

# medicalInfoExample
source: Ex: Allergies, asthma, medication, etc.
es: Ej: Alergias, asma, medicación, etc.
pt: Ex: Alergias, asma, medicação, etc.

source: Account Actions
es: Acciones de Cuenta
pt: Ações da Conta

# becomeATeacher
source: Become a teacher and start your journey.
es: Conviértete en maestro e inicia tu camino.
pt: Torne-se um mestre e inicie seu caminho.

source: My Data
es: Mis Datos
pt: Meus Dados

source: My Profile
es: Mi Perfil
pt: Meu Perfil

# profileUpdateError
source: Error updating profile: {message}
es: Error al actualizar el perfil: {message}
pt: Erro ao atualizar o perfil: {message}

# noStudentsWithStatus
source: No students with status {state}
es: No hay alumnos en estado {state}
pt: Não há alunos com o status {state}

source: No Name
es: Sin Nombre
pt: Sem Nome

# applicationDate
source: Application date: {message}
es: Fecha de solicitud: {message}
pt: Data da solicitação: {message}

# studentAcceptedSuccess
source: Student accepted successfully.
es: Alumno aceptado con éxito.
pt: Aluno aceito com sucesso.

source: Application rejected.
es: Solicitud rechazada.
pt: Solicitação rejeitada.

# noSchedulesDefined
source: No schedules defined. Press (+) to add the first one.
es: No hay horarios definidos. Presiona (+) para añadir el primero.
pt: Não há horários definidos. Pressione (+) para adicionar o primeiro.

source: School Community
es: Comunidad de la Escuela
pt: Comunidade da Escola

source: Error loading members.
es: Error al cargar los miembros.
pt: Erro ao carregar os membros.

# noActiveMembersYet
source: There are no active members in the school yet.
es: Aún no hay miembros activos en la escuela.
pt: Ainda não há membros ativos na escola.

source: My Payments
es: Mis Pagos
pt: Meus Pagamentos

# errorLoadingPaymentHistory
source: Error loading your payment history.
es: Error al cargar tu historial de pagos.
pt: Erro ao carregar seu histórico de pagamentos.

# noPaymentsRegisteredYet
source: You have no registered payments yet.
es: Aún no tienes pagos registrados.
pt: Você ainda não tem pagamentos registrados.

# paymentDetails
source: {concept} Paid on {date}
es: {concept} Pagado el {date}
pt: {concept} Pago em {date}

source: My Progress
es: Mi Progreso
pt: Meu Progresso

source: Your Path
es: Tu Camino
pt: Seu Caminho

source: Promotion History
es: Historial de Promociones
pt: Histórico de Promoções

source: Assigned Techniques
es: Técnicas Asignadas
pt: Técnicas Designadas

source: My Attendance History
es: Mi Historial de Asistencia
pt: Meu Histórico de Presença

# noLevelAssignedYet
source: You don't have a level assigned yet.
es: Aún no tienes un nivel asignado.
pt: Você ainda não tem um nível designado.

source: Your Current Level
es: Tu Nivel Actual
pt: Seu Nível Atual

# progressionSystemNotDefined
source: The progression system has not been defined.
es: El sistema de progresión no ha sido definido.
pt: O sistema de progressão não foi definido.

# teacherHasNotAssignedTechniques
source: Your teacher has not assigned you techniques yet.
es: Tu maestro aún no te ha asignado técnicas.
pt: Seu mestre ainda não lhe designou técnicas.

# noPromotionsRegisteredYet
source: You have no promotions registered yet.
es: Aún no tienes promociones registradas.
pt: Você ainda não tem promoções registradas.

# couldNotOpenVideo
source: Could not open video: {link}
es: No se pudo abrir el video: {link}
pt: Não foi possível abrir o vídeo: {link}

source: No description available.
es: No hay descripción disponible.
pt: Nenhuma descrição disponível.

source: Watch Technique Video
es: Ver Video de la Técnica
pt: Assistir Vídeo da Técnica

source: Close
es: Cerrar
pt: Fechar

source: My School
es: Mi Escuela
pt: Minha Escola

# couldNotLoadSchoolInfo
source: Could not load school information.
es: No se pudo cargar la información de la escuela.
pt: Não foi possível carregar as informações da escola.

source: Address
es: Dirección
pt: Endereço

source: Upcoming Events
es: Próximos Eventos
pt: Próximos Eventos

source: Class Schedule
es: Horario de Clases
pt: Horário de Aulas

# scheduleNotDefinedYet
source: The schedule has not been defined yet.
es: El horario aún no ha sido definido.
pt: O horário ainda não foi definido.

source: Manage Children
es: Gestionar Hijos
pt: Gerenciar Filhos

# manageChildrenSubtitle
source: Add your children and manage their profiles.
es: Añade a tus hijos y gestiona sus perfiles.
pt: Adicione seus filhos e gerencie seus perfis.

# iAmAParent
source: I'm a Parent/Guardian
es: Soy Padre/Tutor
pt: Sou Pai/Tutor

# parentFlowDescription
source: By choosing 'Parent/Guardian', the next step will be to add your children's profiles.
es: Al elegir 'Padre/Tutor', el siguiente paso será añadir los perfiles de tus hijos.
pt: Ao escolher 'Pai/Tutor', o próximo passo será adicionar os perfis dos seus filhos.

source: Add Child
es: Añadir Hijo/a
pt: Adicionar Filho(a)

# childFullName
source: Child's Full Name
es: Nombre y Apellido del Hijo/a
pt: Nome Completo do Filho(a)

# addChildTitle
source: Add Child's Profile
es: Añadir Perfil de Hijo/a
pt: Adicionar Perfil do Filho(a)

# addChildDescription
source: Complete the data below to create a separate profile for your child. You will be able to enroll them in schools and manage their progress.
es: Completa los datos a continuación para crear un perfil separado para tu hijo/a. Podrás inscribirlo/a en escuelas y gestionar su progreso.
pt: Preencha os dados abaixo para criar um perfil separado para seu/sua filho(a). Você poderá inscrevê-lo(a) em escolas e gerenciar seu progresso.

# childData
source: Child's Data
es: Datos del Hijo/a
pt: Dados do Filho(a)

source: Save Child
es: Guardar Hijo/a
pt: Salvar Filho(a)

# creatingChildProfile
source: Creating child's profile...
es: Creando perfil del hijo/a...
pt: Criando perfil do filho(a)...

# childProfileCreatedSuccess
source: Child's profile created successfully.
es: Perfil del hijo/a creado con éxito.
pt: Perfil do filho(a) criado com sucesso.

# childProfileCreatedError
source: Error creating child's profile: {e}
es: Error al crear el perfil del hijo/a: {e}
pt: Erro ao criar o perfil do filho(a): {e}

# requiredField
source: This field is required.
es: Este campo es requerido.
pt: Este campo é obrigatório.

source: Guardian Panel
es: Panel de Tutor
pt: Painel do Tutor

source: My Children
es: Mis Hijos
pt: Meus Filhos

# noChildrenAdded
source: You haven't added any child profiles yet. Press (+) to start.
es: Aún no has añadido ningún perfil de hijo/a. Presiona (+) para empezar.
pt: Você ainda não adicionou nenhum perfil de filho(a). Pressione (+) para começar.

# errorLoadingChildren
source: Error loading your children's profiles.
es: Error al cargar los perfiles de tus hijos.
pt: Erro ao carregar os perfis dos seus filhos.

# noActiveProfilesMessage
source: This profile is not yet enrolled in any school.
es: Este perfil todavía no está inscrito en ninguna escuela.
pt: Este perfil ainda não está inscrito em nenhuma escola.
