Repository: spcolonna/toko
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# enrollInSchool
source: Enroll in a School
es: Inscribir en una Escuela
pt: Inscrever-se em uma Escola

# searchForNewSchool
source: Search for a New School
es: Buscar Nueva Escuela
pt: Buscar Nova Escola

# alreadyLinkedToSchool
source: You already have a link with this school.
es: Ya tienes un vínculo con esta escuela.
pt: Você já tem um vínculo com esta escola.

# confirmApplicationTitle
source: Confirm Application
es: Confirmar Postulación
pt: Confirmar Inscrição

# confirmApplicationMessage
source: Do you want to send your application to join "{schoolName}"?
es: ¿Quieres enviar tu solicitud para unirte a "{schoolName}"?
pt: Deseja enviar sua solicitação para se juntar a "{schoolName}"?

source: Send
es: Enviar
pt: Enviar

# applicationSentSuccess
source: Application to "{schoolName}" sent!
es: ¡Solicitud para "{schoolName}" enviada!
pt: Solicitação para "{schoolName}" enviada!

# applicationSentError
source: Error sending application: {e}
es: Error al enviar la solicitud: {e}
pt: Erro ao enviar a solicitação: {e}

source: No new schools found.
es: No se encontraron nuevas escuelas.
pt: Nenhuma nova escola encontrada.

source: Apply
es: Postularme
pt: Inscrever-se

source: No City
es: Sin Ciudad
pt: Sem Cidade

source: Manage Profiles
es: Gestionar Perfiles
pt: Gerenciar Perfis

source: My User
es: Mi Usuario
pt: Meu Usuário

# associatedWith
source: Associated with: {schoolName}
es: Asociada a: {schoolName}
pt: Associada a: {schoolName}

# searchParentSchool
source: Search for main school
es: Buscar escuela principal
pt: Buscar escola principal

# associateLaterMessage
source: If you can't find the school, you can associate it later from the management panel.
es: Si no encuentras la escuela, puedes asociarla más tarde desde el panel de gestión.
pt: Se você не encontrar a escola, pode associá-la mais tarde no painel de gestão.

source: Disciplines
es: Disciplinas
pt: Disciplinas

# addAtLeastOneDiscipline
source: You must add at least one discipline to your school.
es: Debes añadir al menos una disciplina a tu escuela.
pt: Você deve adicionar pelo menos uma disciplina à sua escola.

source: Add Discipline
es: Añadir Disciplina
pt: Adicionar Disciplina

# noDisciplinesAdded
source: No disciplines added yet.
es: Ninguna disciplina añadida todavía.
pt: Nenhuma disciplina adicionada ainda.

# defineYourCategories
source: 1. Define your Categories
es: 1. Define tus Categorías
pt: 1. Defina suas Categorias

source: Category Name
es: Nombre de la Categoría
pt: Nome da Categoria

# categoryNameHint
source: Ex: Forms, Katas, Techniques, Weapons
es: Ej: Formas, Katas, Técnicas, Armas
pt: Ex: Formas, Katas, Técnicas, Armas

# categoriesAppearHere
source: The categories you add will appear here.
es: Las categorías que añadas aparecerán aquí.
pt: As categorias que você adicionar aparecerão aqui.

# addYourTechniques
source: 2. Add your Techniques
es: 2. Añade tus Técnicas
pt: 2. Adicione suas Técnicas

# createCategoriesFirst
source: Create categories first, then add your first technique.
es: Crea categorías y luego añade tu primera técnica.
pt: Crie categorias primeiro e, em seguida, adicione sua primeira técnica.

# techniqueNumber
source: Technique #{index}
es: Técnica #{index}
pt: Técnica #{index}

source: Technique Name *
es: Nombre de la Técnica *
pt: Nome da Técnica *

# selectCategory
source: Select a category
es: Selecciona una categoría
pt: Selecione uma categoria

# categoryLabel
source: Category *
es: Categoría *
pt: Categoria *

source: Description (optional)
es: Descripción (opcional)
pt: Descrição (opcional)

source: Video Link (optional)
es: Enlace a Video (opcional)
pt: Link do Vídeo (opcional)

source: Add Technique
es: Añadir Técnica
pt: Adicionar Técnica

# dontWorryAddEverythingNow
source: Don't worry about adding everything now. You can always manage your techniques from your school's control panel.
es: No te preocupes por añadir todo ahora. Siempre podrás gestionar tus técnicas desde el panel de control de tu escuela.
pt: Não se preocupe em adicionar tudo agora. Você sempre pode gerenciar suas técnicas no painel de controle da sua escola.

# atLeastOneCategoryError
source: You must create at least one category.
es: Debes crear al menos una categoría.
pt: Você deve criar pelo menos uma categoria.

# allTechniquesNeedNameCategoryError
source: All techniques must have a name and a category assigned.
es: Todas las técnicas deben tener un nombre y una categoría asignada.
pt: Todas as técnicas devem ter um nome e uma categoria atribuída.

# techniquesFor
source: Techniques for "{disciplineName}"
es: Técnicas para "{disciplineName}"
pt: Técnicas para "{disciplineName}"

source: Configure Pricing (Step 5)
es: Configurar Precios (Paso 5)
pt: Configurar Preços (Passo 5)

# uniqueCostsAndCurrency
source: Unique Costs & Currency
es: Costos Únicos y Moneda
pt: Custos Únicos e Moeda

source: Currency
es: Moneda
pt: Moeda

source: Inscription Fee
es: Precio de Inscripción
pt: Taxa de Inscrição

# examFee
source: Fee per Exam
es: Precio por Examen
pt: Taxa por Exame

source: Monthly Fee Plans
es: Planes de Cuotas Mensuales
pt: Planos de Mensalidades

source: Add new plan
es: Añadir nuevo plan
pt: Adicionar novo plano

# addAtLeastOnePlan
source: Add at least one monthly payment plan.
es: Añade al menos un plan de pago mensual.
pt: Adicione pelo menos um plano de pagamento mensal.

source: Plan Title
es: Título del Plan
pt: Título do Plano

# planTitleExample
source: Ex: Family Plan
es: Ej: Plan Familiar
pt: Ex: Plano Familiar

source: Monthly Amount
es: Monto Mensual
pt: Valor Mensal

# planDescriptionOptional
source: Description (optional)
es: Descripción (opcional)
pt: Descrição (opcional)

# planDescriptionExample
source: Ex: For 2 or more siblings
es: Ej: Para 2 o más hermanos
pt: Ex: Para 2 ou mais irmãos

# allPlansNeedTitleAndAmount
source: All plans must have a title and an amount greater than zero.
es: Todos los planes deben tener un título y un monto mayor a cero.
pt: Todos os planos devem ter um título e um valor maior que zero.

source: Review and Finalize (Step 6)
es: Revisar y Finalizar (Paso 6)
pt: Revisar e Finalizar (Passo 6)

# almostDoneReviewInfo
source: Almost there! Please review that all your school's information is correct.
es: ¡Casi listo! Revisa que toda la información de tu escuela sea correcta.
pt: Quase pronto! Revise se todas as informações da sua escola estão corretas.

source: School Data
es: Datos de la Escuela
pt: Dados da Escola

source: Progression System
es: Sistema de Progresión
pt: Sistema de Progressão

source: Pricing and Plans
es: Precios y Planes
pt: Preços e Planos

# disciplineLabel
source: Discipline: {disciplineName}
es: Disciplina: {disciplineName}
pt: Disciplina: {disciplineName}

source: Levels Created
es: Niveles Creados
pt: Níveis Criados

source: Techniques Added
es: Técnicas Añadidas
pt: Técnicas Adicionadas

# finalizeAndOpenSchool
source: Finalize and Open my School
es: Finalizar y Abrir mi Escuela
pt: Finalizar e Abrir minha Escola

# errorFinalizing
source: Error finalizing: {e}
es: Error al finalizar: {e}
pt: Erro ao finalizar: {e}

# categoriesLabel
source: Categories
es: Categorías
pt: Categorias

# selectDisciplinesPrompt
source: Select one or more. The first one you choose will be the primary.
es: Selecciona una o más. La primera que elijas será la principal.
pt: Selecione uma ou mais. A primeira que escolher será a principal.

source: Institutional Data (Optional)
es: Datos Institucionales (Opcional)
pt: Dados Institucionais (Opcional)

source: City
es: Ciudad
pt: Cidade

source: Description
es: Descripción
pt: Descrição

# disciplineConfigPanel
source: Discipline Configuration
es: Configuración de Disciplinas
pt: Configuração de Disciplinas

# disciplineConfigMessage
source: Select a discipline to configure its levels and techniques. When you're done with all of them, press 'Continue'.
es: Selecciona una disciplina para configurar sus niveles y técnicas. Cuando termines con todas, presiona 'Continuar'.
pt: Selecione uma disciplina para configurar seus níveis e técnicas. Quando terminar com todas, pressione 'Continuar'.

# statusNotConfigured
source: Not configured
es: Sin configurar
pt: Não configurado

# statusConfigured
source: Configured
es: Configurado
pt: Configurado

source: Continue to Pricing
es: Continuar a Precios
pt: Continuar para Preços

source: Error loading disciplines.
es: Error al cargar las disciplinas.
pt: Erro ao carregar as disciplinas.

# levelsFor
source: Levels for "{disciplineName}"
es: Niveles para "{disciplineName}"
pt: Níveis para "{disciplineName}"

source: Progression System Name *
es: Nombre del Sistema de Progresión *
pt: Nome do Sistema de Progressão *

# progressionSystemHint
source: Ex: Sashes, Belts, Grades
es: Ej: Fajas, Cinturones, Grados
pt: Ex: Faixas, Cintos, Graus

# levelsOrderHint
source: Levels (order from lowest to highest)
es: Niveles (ordena del más bajo al más alto)
pt: Níveis (ordene do mais baixo ao mais alto)

# progressionSystemNameRequired
source: Please give your progression system a name.
es: Por favor, dale un nombre a tu sistema de progresión.
pt: Por favor, dê um nome ao seu sistema de progressão.

# allLevelsNeedAName
source: Make sure all levels have a name.
es: Asegúrate de que todos los niveles tengan un nombre.
pt: Certifique-se de que todos os níveis tenham um nome.

source: No disciplines found.
es: No se encontraron disciplinas.
pt: Nenhuma disciplina encontrada.

# levelNameHint
source: Level Name
es: Nombre del Nivel
pt: Nome do Nível

source: Configure Discipline
es: Configurar Disciplina
pt: Configurar Disciplina

# step1Levels
source: Step 1: Configure Levels
es: Paso 1: Configurar Niveles
pt: Passo 1: Configurar Níveis

# step2Techniques
source: Step 2: Configure Techniques
es: Paso 2: Configurar Técnicas
pt: Passo 2: Configurar Técnicas

# continueStep
source: Continue
es: Continuar
pt: Continuar

# finish
source: Finish & Return to Panel
es: Finalizar y Volver al Panel
pt: Finalizar e Voltar ao Painel

# skipStep
source: Skip this step
es: Omitir este paso
pt: Pular esta etapa

# unsavedChangesWarning
source: You have unsaved changes. Are you sure you want to exit? Progress for this discipline will not be saved.
es: Tienes cambios sin guardar. ¿Estás seguro de que quieres salir? El progreso para esta disciplina no se guardará.
pt: Você tem alterações não salvas. Tem certeza de que deseja sair? O progresso para esta disciplina não será salvo.

source: Yes, exit
es: Sí, salir
pt: Sim, sair

source: No, stay
es: No, quedarse
pt: Não, ficar

source: No Discipline
es: Sin Disciplina
pt: Sem Disciplina

# selectDiscipline
source: Select a discipline *
es: Selecciona una disciplina *
pt: Selecione uma disciplina *

source: Manage Curriculum
es: Gestionar Currículo
pt: Gerenciar Currículo

# manageCurriculumDescription
source: Edit levels and techniques for each discipline.
es: Edita niveles y técnicas para cada disciplina.
pt: Edite níveis e técnicas para cada disciplina.

source: Curriculum by Discipline
es: Currículo por Disciplina
pt: Currículo por Disciplina

# selectDisciplineToEdit
source: Select a discipline to view and edit its levels and techniques.
es: Selecciona una disciplina para ver y editar sus niveles y técnicas.
pt: Selecione uma disciplina para ver e editar seus níveis e técnicas.

# curriculumFor
source: Curriculum for {disciplineName}
es: Currículo de {disciplineName}
pt: Currículo de {disciplineName}

source: Save All Changes
es: Guardar Todos los Cambios
pt: Salvar Todas as Alterações

# curriculumSaveSuccess
source: Curriculum saved successfully.
es: Currículo guardado con éxito.
pt: Currículo salvo com sucesso.

source: Manage Disciplines
es: Gestionar Disciplinas
pt: Gerenciar Disciplinas

source: Active
es: Activa
pt: Ativa

source: Inactive
es: Inactiva
pt: Inativa

source: School data updated.
es: Datos de la escuela actualizados.
pt: Dados da escola atualizados.

source: Enroll in Discipline
es: Inscribir en Disciplina
pt: Inscrever na Disciplina

# selectDisciplineForStudent
source: Select the primary discipline this student will be enrolled in.
es: Selecciona la disciplina principal en la que se inscribirá este alumno.
pt: Selecione a disciplina principal na qual este aluno será inscrito.

# noDisciplinesAvailable
source: There are no active disciplines in your school. Go to Management -> Curriculum to create them.
es: No hay disciplinas activas en tu escuela. Ve a Gestión -> Currículo para crearlas.
pt: Não há disciplinas ativas na sua escola. Vá para Gestão -> Currículo para criá-las.

# progressFor
source: Progress ({disciplineName})
es: Progreso ({disciplineName})
pt: Progresso ({disciplineName})

source: Enroll in Disciplines
es: Inscribir en Disciplinas
pt: Inscrever em Disciplinas

# noDisciplinesEnrolled
source: This student is not yet enrolled in any disciplines.
es: Este alumno aún no está inscrito en ninguna disciplina.
pt: Este aluno ainda не está inscrito em nenhuma disciplina.

# noProgressSystemForDiscipline
source: This discipline does not have a progression system defined yet.
es: Esta disciplina aún no tiene un sistema de progresión definido.
pt: Esta disciplina ainda não possui um sistema de progressão definido.

# noTechniquesForDiscipline
source: This discipline does not have any techniques defined yet.
es: Esta disciplina aún no tiene técnicas definidas.
pt: Esta disciplina ainda não possui técnicas definidas.

# assignTechniquesFor
source: Assign Techniques for {disciplineName}
es: Asignar Técnicas para {disciplineName}
pt: Designar Técnicas para {disciplineName}

source: Save Assignments
es: Guardar Asignaciones
pt: Salvar Designações

# techniquesAssignedSuccess
source: Techniques assigned successfully.
es: Técnicas asignadas con éxito.
pt: Técnicas designadas com sucesso.

# noDisciplinesEnrolledStudent
source: You are not yet enrolled in any disciplines.
es: Aún no estás inscrito en ninguna disciplina.
pt: Você ainda не está inscrito em nenhuma disciplina.

source: Plan Payment
es: Pago de Plan
pt: Pagamento de Plano

source: Special Payment
es: Pago Especial
pt: Pagamento Especial

source: Edit Event
es: Editar Evento
pt: Editar Evento

source: Create New Event
es: Crear Nuevo Evento
pt: Criar Novo Evento

source: Event Title *
es: Título del Evento *
pt: Título do Evento *

# pleaseCompleteDateTime
source: Please complete the date and times.
es: Por favor, completa la fecha y las horas.
pt: Por favor, complete a data e os horários.

source: Event updated.
es: Evento actualizado.
pt: Evento atualizado.

# eventCreatedInviteStudents
source: Event created! Now you can invite students.
es: ¡Evento creado! Ahora puedes invitar a los alumnos.
pt: Evento criado! Agora você pode convidar os alunos.

# eventCreationError
source: Error creating event: {e}
es: Error al crear el evento: {e}
pt: Erro ao criar o evento: {e}

source: Select Date *
es: Seleccionar Fecha *
pt: Selecionar Data *

source: Location (Optional)
es: Ubicación (Opcional)
pt: Localização (Opcional)

source: Cost (Optional)
es: Costo (Opcional)
pt: Custo (Opcional)

source: Involved Disciplines
es: Disciplinas Involucradas
pt: Disciplinas Envolvidas

# selectAtLeastOneDiscipline
source: You must select at least one discipline.
es: Debes seleccionar al menos una disciplina.
pt: Você deve selecionar pelo menos uma disciplina.

# confirmPaymentDelete
source: Are you sure you want to permanently delete this payment?
es: ¿Estás seguro de que quieres eliminar este pago de forma permanente?
pt: Tem certeza de que deseja excluir este pagamento permanentemente?

# paymentDeletedSuccess
source: Payment deleted successfully.
es: Pago eliminado con éxito.
pt: Pagamento excluído com sucesso.

# confirmAttendanceDelete
source: Are you sure you want to delete this attendance? This action only removes the student from this class record, it does not delete the class itself.
es: ¿Estás seguro de que quieres eliminar esta asistencia? Esta acción solo quita al alumno de este registro de clase, no borra la clase.
pt: Tem certeza de que deseja excluir esta presença? Esta ação remove apenas o aluno deste registro de aula, não exclui a aula em si.

# assistanceDelete
source: Attendance deleted.
es: Asistencia eliminada.
pt: Presença excluída.

source: Unassign Technique
es: Quitar Técnica
pt: Desatribuir Técnica

# unassignTechniqueConfirm
source: Are you sure you want to unassign this technique from the student?
es: ¿Estás seguro de que quieres quitarle esta técnica al alumno?
pt: Tem certeza de que deseja desatribuir esta técnica do aluno?

# techniqueUnassignedSuccess
source: Technique unassigned successfully.
es: Técnica quitada con éxito.
pt: Técnica desatribuída com sucesso.

# revertPromotionConfirm
source: Are you sure? This will delete the history record and revert the student's level to the previous one.
es: ¿Estás seguro? Esto eliminará el registro del historial y revertirá el nivel del alumno al anterior.
pt: Tem certeza? Isso excluirá o registro do histórico e reverterá o nível do aluno para o anterior.

source: Revert Promotion
es: Revertir Promoción
pt: Reverter Promoção

# emailLabel
source: Email
es: Correo Electrónico

source: Martial Art
es: Arte Marcial
